vinhlephu-lpv/robot-ws/src/esp32_source/code3008.ino
  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) { wHealth[3] = wHealth[2]; continue; }
#endif
    float rpm = abs(enc[i].rpm);
    int   pwm = abs(slew[i].target);
    float tgt = wpid[i].targetRPM;

    // 1. Phát hiện kẹt cứng / hỏng encoder (PWM cấp cao liên tục mà bánh không quay)
    if (pwm > STALL_PWM_THRESHOLD && rpm < STALL_RPM_THRESHOLD) {
      if (wHealth[i].stallStartTime == 0) wHealth[i].stallStartTime = now;
      if (now - wHealth[i].stallStartTime > STALL_DETECT_MS && !wHealth[i].isStalled) {
        wHealth[i].isStalled = true;
        Serial.printf("[HEALTH] CANH BAO: Banh %d bi KHOA/HONG!\n", i + 1);
      }
    } else {
      wHealth[i].stallStartTime = 0;
      wHealth[i].isStalled = false;
    }

    // 2. Phát hiện bánh bị hẫng / mất tiếp xúc mặt đất (quay trượt tự do ở tốc độ cao trong khi xe đang tải nặng)
    if (tgt > 0 && avgRpm > 0.1f && rpm > 1.4f * tgt && rpm > 1.5f * avgRpm) {
      if (wHealth[i].hangStartTime == 0) wHealth[i].hangStartTime = now;
      if (now - wHealth[i].hangStartTime > 400 && !wHealth[i].isHanging) {
        wHealth[i].isHanging = true;
        Serial.printf("[HEALTH] PHAT HIEN: Banh %d bi HANG mat tiep xuc dat!\n", i + 1);
      }
    } else {
      wHealth[i].hangStartTime = 0;
      wHealth[i].isHanging = false;
    }

    wHealth[i].isFaulty = (wHealth[i].isStalled || wHealth[i].isHanging);
  }
}

// ============================================================
//  8. THUẬT TOÁN PID + TORQUE BOOST + TỰ BÙ MÔ-MEN BÁNH HỎNG/HẪNG
// ============================================================
void updatePID(float dt) {
  if (!pidGlobalEnabled) return;

  // 1. BỘ KHÓA NEO TỌA ĐỘ VỊ TRÍ VẠCH ĐÍCH (Position Anchor Filter)
  // Khi xe đã đến đích và dừng lại hẳn, nếu xe bị lực ngoài hoặc dốc đẩy trôi > 2 xung (~3mm), ghìm nhẹ xe
  if (isPositionAnchorLocked && !isMoving) {
    for (int i = 0; i < 4; i++) {
      long pulseDiff = enc[i].count - anchorTargetPulses[i];
      if (abs(pulseDiff) > 2) {
        int holdPWM = constrain((int)(-pulseDiff * 0.8f * enc[i].sign), -50, 50);
        slew[i].target = holdPWM;
      } else {
        slew[i].target = 0;
      }
    }
    return;
  }

  if (!isMoving) return;

  // 1. TÍNH VẬN TỐC THỰC TẾ CỦA 4 BÁNH & CỤM TRÁI - PHẢI
  float actualRPM[4];
  for (int j = 0; j < 4; j++) {
    actualRPM[j] = fabsf(enc[j].rpm);
  }

  // Tốc độ trung bình cụm Trái (Bánh 1 & 2) và cụm Phải (Bánh 3 & 4)
  float avgLeft  = (actualRPM[0] + actualRPM[1]) / 2.0f;
  float avgRight = (actualRPM[2] + actualRPM[3]) / 2.0f;
  float avgTotal = (avgLeft + avgRight) / 2.0f;

  // 2. BỘ KHÓA ĐỒNG TỐC VI SAI TRÁI - PHẢI TỨC THỜI (Instantaneous Left-Right Differential Lock):
  // Xóa bỏ hoàn toàn sai số quãng đường tích lũy gây lệch tốc.
  // Khi xe chạy thẳng (FORWARD / BACKWARD):
  // Nếu Bánh 1 & 2 (cụm Trái) quay nhanh hơn Bánh 3 & 4 (cụm Phải) -> lrDiff > 0:
  // Kéo hãm bên Trái, đồng thời bù thêm xung cho bên Phải để 2 bên khóa chặt đồng tốc 100%!
  float lrDiff = 0.0f;
  if ((currentDirection == "FORWARD" || currentDirection == "BACKWARD") && isMoving) {
    lrDiff = avgLeft - avgRight;
  }
  float lrCorrection = constrain(lrDiff * K_LR_BALANCE, -18.0f, 18.0f); // Bù vi sai trực tiếp +-18 PWM

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) {
      wpid[3].pwmOutput     = wpid[2].pwmOutput;
      wpid[3].prevPwmOutput = wpid[2].prevPwmOutput;
      slew[3].target        = slew[2].target;
      continue;
    }
#endif
    if (!wpid[i].enabled) continue;

    float rpm_act = actualRPM[i];
    float target  = wpid[i].targetRPM;
    bool  isLeft  = (i == 0 || i == 1);

    if (target <= 0.1f) {
      wpid[i].pwmOutput = 0; wpid[i].integral = 0; slew[i].target = 0;
      continue;
    }

    // 1. Feedforward PWM cơ sở
    float ff_pwm = (target / 220.0f) * (255.0f - MIN_PWM) + MIN_PWM;
    float coulomb_ff = (target > 1.0f) ? K_COULOMB_FRICTION : 0.0f;

    // 2. Sai số bám tốc độ mục tiêu (Tracking Error)
    float track_error = target - rpm_act;
    if (fabsf(track_error) < PID_ERROR_DEADBAND) {
      track_error = 0.0f;
    }

    // 3. Sai số đồng tốc Cross-Coupling 4 bánh (Chỉ khóa cứng khi chạy thẳng FORWARD / BACKWARD, khi rẽ hoặc ROS thì thả lỏng để xoay mượt):
    float sync_error = 0.0f;
    if ((currentDirection == "FORWARD" || currentDirection == "BACKWARD") && isMoving) {
      sync_error = (avgTotal - rpm_act);
    }

    // 4. Sai số tổng hợp đưa vào khâu PID:
    float total_error = track_error + (sync_error * K_SYNC_CROSS_WHEEL);

    // 5. Khâu tích phân (Integral) có Anti-Windup thích ứng theo dải tốc độ:
    float maxIntegral = (target <= 65.0f) ? 50.0f : 100.0f;
    wpid[i].integral = constrain(wpid[i].integral + total_error * dt, -maxIntegral, maxIntegral);

    // 6. Khâu vi phân (Derivative) có lọc nhiễu
    float rawDeriv = (total_error - wpid[i].lastError) / dt;
    wpid[i].filteredDeriv = DERIVATIVE_FILTER * rawDeriv + (1.0f - DERIVATIVE_FILTER) * wpid[i].filteredDeriv;
    wpid[i].lastError = total_error;

    // 7. Tính toán PID cơ sở
    float pid_corr = (wpid[i].kp * total_error) + (wpid[i].ki * wpid[i].integral) + (wpid[i].kd * wpid[i].filteredDeriv);

    // 8. Bù cân bằng cụm Trái - Phải trực tiếp (Left-Right Balancing Injection):
    // Bánh 1 & 2 (bên Trái): bị trừ bớt lrCorrection nếu đang chạy nhanh hơn
    // Bánh 3 & 4 (bên Phải): được cộng thêm lrCorrection để bắt kịp
    float balance_corr = isLeft ? (-lrCorrection) : (lrCorrection);

    // Đồng bộ nội bộ giữa 2 bánh cùng bên (Trái trước vs Trái sau, Phải trước vs Phải sau)
    float side_sync = isLeft ? (avgLeft - rpm_act) : (avgRight - rpm_act);
    float internal_sync_corr = side_sync * 0.40f;

    // 9. Bù mô-men xoắn tốc độ thấp thích ứng tải (High-Torque Low-Speed Boost)
    float torque_boost = 0.0f;
    if (target < 75.0f && track_error > 0.0f) {
      float defectRatio = constrain(track_error / target, 0.0f, 1.0f);
      torque_boost = defectRatio * 65.0f;
    }
    if (rpm_act < 2.5f && target > 2.5f) {
      torque_boost += 30.0f;
    }

    // Khâu ghì hãm chống vọt tốc độ khi chạy chậm
    if (rpm_act >= target) {
      torque_boost = 0.0f;
      if (rpm_act > target + 1.5f) {
        pid_corr -= (rpm_act - target) * 2.5f;
      }
    }

    // 10. Tổng hợp PWM điều khiển hoàn chỉnh:
    int desired = constrain((int)(ff_pwm + coulomb_ff + pid_corr + balance_corr + internal_sync_corr + torque_boost), 0, 255);

    // Trần an toàn ở tốc độ thấp:
    if (target <= 65.0f) {
      int safeLowSpeedCap = constrain((int)(MIN_PWM + (target / 65.0f) * 60.0f + (track_error > 4.0f ? 45 : 0)), MIN_PWM, 255);
      if (rpm_act >= target * 0.85f && desired > safeLowSpeedCap) {
        desired = safeLowSpeedCap;
      }
    } else {
      int userPwmCap = max((int)currentSpeed, MIN_PWM);
      if (rpm_act >= target * 0.5f && desired > userPwmCap) {
        desired = userPwmCap;
      }
    }

    // Giới hạn biến thiên PWM bất đối xứng: Bơm lực tăng tốc nhanh khi leo cản
    int maxChange = (desired > wpid[i].prevPwmOutput) ? MAX_PWM_CHANGE_UP : MAX_PWM_CHANGE_DOWN;
    int delta   = constrain(desired - wpid[i].prevPwmOutput, -maxChange, maxChange);
    wpid[i].pwmOutput     = constrain(wpid[i].prevPwmOutput + delta, 0, 255);
    wpid[i].prevPwmOutput = wpid[i].pwmOutput;

    if (wpid[i].pwmOutput > 0 && wpid[i].pwmOutput < MIN_PWM) wpid[i].pwmOutput = MIN_PWM;
    
    // XỬ LÝ ĐẶC BIỆT CHO BÁNH BỊ SỰ CỐ:
    if (wHealth[i].isStalled) { 
      // Bánh bị kẹt chết quá 1.2s -> Giảm tải triệt để để bảo vệ driver/motor không bị cháy
      wpid[i].pwmOutput = max(0, wpid[i].pwmOutput - 50); 
      wpid[i].integral = 0; 
    } else if (wHealth[i].isHanging) {
      // Bánh bị hẫng lên không trung -> Hãm PWM để dồn toàn bộ công suất điện cho các bánh chạm đất
      wpid[i].pwmOutput = MIN_PWM;
      wpid[i].integral = 0;
    }

    // 9. Quy tắc chiều quay 4 bánh (Tank Drive & ROS)
    int sign = 0;
    if (currentDirection == "FORWARD")       sign = 1;               // Trái (+), Phải (+)
    else if (currentDirection == "BACKWARD") sign = -1;              // Trái (-), Phải (-)
    else if (currentDirection == "LEFT")     sign = isLeft ? -1 : 1; // Trái (-), Phải (+) -> Xoay trái
    else if (currentDirection == "RIGHT")    sign = isLeft ? 1 : -1; // Trái (+), Phải (-) -> Xoay phải
    else if (currentDirection == "ROS")      sign = (rosTargetRpmSigned[i] >= 0.0f) ? 1 : -1;

    slew[i].target = sign * wpid[i].pwmOutput;
  }
}

