vinhlephu-lpv/robot-ws/src/esp32_source/code3008.ino
// ============================================================
//  11. IN DEBUG SERIAL MONITOR (500ms)
// ============================================================
void printDebugInfo() {
  if (currentDirection == "ROS") return; // Nhường băng thông Serial cho gói ENC của ROS 2

  unsigned long now = millis();
  if (now - lastDebugPrintTime < DEBUG_PRINT_INTERVAL_MS) return;
  lastDebugPrintTime = now;

  bool active = isMoving;
  for (int i = 0; i < 4; i++) if (enc[i].rpm != 0) active = true;
  if (!active) return;

  int healthyCount = 0;
  for (int i = 0; i < 4; i++) if (!wHealth[i].isFaulty) healthyCount++;

  Serial.println("----");
  if (isDistanceMode) {
    float traveled = (abs(enc[0].distance_m - startDistMeters[0]) + abs(enc[1].distance_m - startDistMeters[1]) +
                      abs(enc[2].distance_m - startDistMeters[2]) + abs(enc[3].distance_m - startDistMeters[3])) / 4.0f;
    Serial.printf("[DIST TRACKING] Đang chạy: %.3f / %.2fm (Còn lại: %.3fm | Target: %.1f RPM)\n",
                  traveled, targetDistMeters, max(0.0f, targetDistMeters - traveled), wpid[0].targetRPM);
  }
  if (healthyCount < 4) {
    Serial.printf("[TRACTION] CHẾ ĐỘ BÙ MÔ-MEN: Phát hiện %d bánh sự cố! Bơm lực kéo cho %d bánh lành.\n",
                  4 - healthyCount, healthyCount);
  }

  for (int i = 0; i < 4; i++) {
    Serial.printf("[W%d] RPM:%6.1f | Spd:%.3fm/s | Dist:%.3fm | PWM:%4d",
                  i + 1, enc[i].rpm, enc[i].speed_ms, enc[i].distance_m, slew[i].target);
    if (pidGlobalEnabled && wpid[i].enabled) {
      Serial.printf(" | PID_tgt:%.0f | PID_pwm:%d", wpid[i].targetRPM, wpid[i].pwmOutput);
    }
    if (wHealth[i].isStalled) Serial.print(" [KHOA/HONG]");
    else if (wHealth[i].isHanging) Serial.print(" [HANG/TRUOT]");
    Serial.println();
  }
}

// ============================================================
//  12. SETUP & WEBSERVER CỐT LÕI
// ============================================================
void setup() {
  // 1. Ép cứng mức 0V ngay dòng đầu tiên
  lockAllDriverPins();

  Serial.begin(115200);
  Serial.setTimeout(10);

  // Tắt LED RGB chân 48 ESP32-S3
#if defined(RGB_LED_PIN)
  neopixelWrite(RGB_LED_PIN, 0, 0, 0);
#endif

  // Khởi tạo PWM 4 driver
  pwmSetup(DRV1_RPWM, CH_DRV1_F); pwmSetup(DRV1_LPWM, CH_DRV1_R);
  pwmSetup(DRV2_RPWM, CH_DRV2_F); pwmSetup(DRV2_LPWM, CH_DRV2_R);
  pwmSetup(DRV3_RPWM, CH_DRV3_F); pwmSetup(DRV3_LPWM, CH_DRV3_R);
  pwmSetup(DRV4_RPWM, CH_DRV4_F); pwmSetup(DRV4_LPWM, CH_DRV4_R);
  writeAllDrives(0, 0, 0, 0);

  // Khởi tạo ngắt 4 Encoder & kích hoạt PID cho cả 4 bánh
  void (*isrFn[4])() = {isr_enc0, isr_enc1, isr_enc2, isr_enc3};
  for (int i = 0; i < 4; i++) {
    pinMode(enc[i].pinA, INPUT_PULLUP);
    pinMode(enc[i].pinB, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(enc[i].pinA), isrFn[i], RISING);
    wpid[i].enabled = true;
    wpid[i].targetRPM = globalTargetRPM;
  }

  Serial.println("\n=== XE TU HANH 4 BANH PID (ROBOT CONTROLLER) ===");
  Serial.printf("Encoder: %d PPR | Banh: %.0fmm | MIN_PWM: %d | 4-Wheel Torque Boost: ON\n",
                ENCODER_PPR, WHEEL_DIAMETER_M * 1000, MIN_PWM);

  // Khởi động WiFi
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.printf("\nDang ket noi den WiFi '%s'...", ssid);
  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 25) {
    writeAllDrives(0, 0, 0, 0);
    delay(500); 
    Serial.print("."); 
    attempts++;
  }
  Serial.println();
  Serial.println("=========================================");
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("  WIFI DA KET NOI THANH CONG!");
    Serial.print  ("  >> IP KET NOI APP: ");
    Serial.println(WiFi.localIP());
    Serial.println("  (Go chu 'IP' tren Serial de xem lai bat ky luc nao)");
  } else {
    Serial.println("  [CANH BAO] Khong the ket noi WiFi!");
    Serial.printf ("  Khong tim thay hoac sai mat khau mang: '%s'\n", ssid);
    Serial.println("  Vui long sua lai ssid/password o dong 71-72!");
  }
  Serial.println("=========================================\n");

  // --- API WebServer ---
  server.enableCORS(true);

  server.on("/ping", HTTP_GET, []() {
    server.send(200, "text/plain", "ESP32 4-Wheel PID - IP: " + WiFi.localIP().toString());
  });

  server.on("/control", []() {
    server.sendHeader("Access-Control-Allow-Origin", "*");

    // 1. Cập nhật tốc độ PWM nếu có tham số: "speed", "val", "pwm", "value"
    int spd = -1;
    if (server.hasArg("speed"))      spd = server.arg("speed").toInt();
    else if (server.hasArg("val"))   spd = server.arg("val").toInt();
    else if (server.hasArg("pwm"))   spd = server.arg("pwm").toInt();
    else if (server.hasArg("value")) spd = server.arg("value").toInt();

    if (spd >= 0) {
      setVehicleSpeed(spd);
    }

    // 2. Xử lý lệnh di chuyển nếu có tham số: "cmd", "command", "action", "dir"
    String cmd = "";
    if (server.hasArg("cmd"))          cmd = server.arg("cmd");
    else if (server.hasArg("command")) cmd = server.arg("command");
    else if (server.hasArg("action"))  cmd = server.arg("action");
    else if (server.hasArg("dir"))     cmd = server.arg("dir");

    if (cmd.length() > 0) {
      handleCommand(cmd);
      server.send(200, "text/plain", "OK: " + cmd + " | Speed: " + String(currentSpeed));
      return;
    }

    // Nếu App chỉ gửi thanh trượt chỉnh tốc độ độc lập (không kèm cmd):
    if (spd >= 0) {
      server.send(200, "text/plain", "OK: Speed updated to " + String(currentSpeed));
      return;
    }

    server.send(400, "text/plain", "Missing cmd or speed");
  });

  // Hỗ trợ endpoint riêng /speed cho các App điều khiển xe
  server.on("/speed", []() {
    server.sendHeader("Access-Control-Allow-Origin", "*");
    int spd = currentSpeed;
    if (server.hasArg("val"))        spd = server.arg("val").toInt();
    else if (server.hasArg("value")) spd = server.arg("value").toInt();
    else if (server.hasArg("speed")) spd = server.arg("speed").toInt();
    else if (server.hasArg("pwm"))   spd = server.arg("pwm").toInt();
    setVehicleSpeed(spd);
    server.send(200, "text/plain", "OK: Speed = " + String(currentSpeed));
  });

